const detailpageparsetarget = [
    {
        "productId": "718614821378",
        "productName": "신상 스타일리쉬한 옥스포드 남성 캐주얼 비즈니스 정장 토시 고급 로퍼"
    },
    
    {
        "productId": "741655261915",
        "productName": "별딱따구리 남자 신발 진가죽 통기성 비즈니스 캐주얼화 소고무창 중장년 아빠 신발 슬립온"
    },
    {
        "productId": "710714339476",
        "productName": "로퍼 남성 가죽 비즈니스 캐주얼 슈즈 옥스포드 2025 봄 신상 통기성 좋은 남성 구두"
    },
    {
        "productId": "711529732674",
        "productName": "2025 신상 남성화 아웃도어 캐주얼 쿠셔닝 속굽 미끄럼 방지 내마모 신발 남성 정장 드라이빙 슈즈"
    },
    {
        "productId": "732446849111",
        "productName": "7필 늑대남성 신발 날개망 통기화 봄가을 신상 스니커즈 스니커즈 여행용 소프트 캔버스화"
    },
    {
        "productId": "696705682534",
        "productName": "잠자리표 진피 남성 구두 신상 비즈니스 정장 아빠 소가죽 키높이 캐주얼 내마모 로퍼"
    },
    {
        "productId": "735900895571",
        "productName": "구두 남자 신발 리얼 가죽 소가죽 신상 정장 덧신 발 쿠션 여름 통기 캐주얼 미끄럼 방지 중장년 아빠 신발"
    },
    {
        "productId": "739248452025",
        "productName": "남성 구두 파라솔 비즈니스 캐주얼화 통기성 스니커즈 아빠 신발 쿠셔닝 런닝화"
    }
    
]